# OpaqueTranslucency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedOpaque..::..OpaqueTranslucency Property
AdvancedOpaque Class See Also
---
The property labeled "Translucency" from the "AdvancedOpaque" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string OpaqueTranslucency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpaqueTranslucency As String
	Get
```

Visual C++
---
```text
public:
static property String^ OpaqueTranslucency {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace